recipes/edamame-rice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Edamame Rice</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Edamame Rice</h1>
<p>
<a href="https://www.chinasichuanfood.com/steamed-tofu/#ingredients">Original link</a> (just using sauce recipe)
</p>

<div id="outline-container-orgb96cd84" class="outline-2">
<h2 id="orgb96cd84">Ingredients</h2>
<div class="outline-text-2" id="text-orgb96cd84">
</div>
<div id="outline-container-org4dbcefa" class="outline-3">
<h3 id="org4dbcefa">Rice/topping</h3>
<div class="outline-text-3" id="text-org4dbcefa">
<ul class="org-ul">
<li>Jasmine or other preferred rice</li>
<li>Edamame (steamed or microwaved)</li>
<li>Peanuts</li>
</ul>
</div>
</div>
<div id="outline-container-org5d2b41a" class="outline-3">
<h3 id="org5d2b41a">Sauce</h3>
<div class="outline-text-3" id="text-org5d2b41a">
<ul class="org-ul">
<li>2 tbsp light soy sauce</li>
<li>1 tbsp vegetarian stir fry sauce</li>
<li>1 tbsp sesame oil</li>
<li>2 garlic cloves, chopped</li>
<li>1 tbsp chopped scallion and coriander (or scallion only)</li>
<li>1/2 tsp salt (taste your sauce and see how much is needed)</li>
<li>1/2 tsp sugar</li>
<li>1/2 tbsp black vinegar</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org647d396" class="outline-2">
<h2 id="org647d396">Instructions</h2>
<div class="outline-text-2" id="text-org647d396">
<ol class="org-ol">
<li>Cook rice and edamame, adjust quantity depending on levels of hunger</li>
<li>Mix sauce ingredients in a small container</li>
<li>To serve, pour sauce over rice and top with edamame and peanuts</li>
</ol>
</div>
</div>
</div>
</body>
</html>